/* Задача 23: Напишите программу, которая принимает 
на вход число (N) и выдаёт таблицу 
кубов чисел от 1 до N. 
3 -> 1, 4, 9
5 -> 1, 8, 27, 64, 125 */

int N = 5;
int count = 1;

while(count <= 5)
{
    Console.Write(Math.Pow(count, 3) + " ");
    count++;
}
