/* Задача 19: Напишите программу, которая 
принимает на вход пятизначное число и 
проверяет, является ли оно палиндромом. 
14212 -> нет 
23432 -> да 
12821 -> да*/

/* int num = new Random().Next(10000, 100000); */

int num = 12321;
Console.WriteLine(num);

int c1 = num / 10000;
int c12 = num / 1000;
int c2 = c12 % 10;
int c1234 = num / 10;
int c4 = c1234 % 10;
int c5 = num % 10;


if(c1 == c5)
{
    if(c2 == c4)
    {
        Console.WriteLine("Это палиндром!");
    }
}
else
{
    Console.WriteLine("Это не палиндром");
}

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////



/*Задача 21: Напишите программу, которая принимает на 
вход координаты двух точек и находит расстояние 
между ними в 3D пространстве. */

int x1 = 4567;
int y1 = 4;
int z1 = 9;

int x2 = 505094;
int y2 = 23843;
int z2 = 4328;


double distance = Math.Pow((Math.Pow(x1 - x2,2) + Math.Pow(y1 - y2, 2) + Math.Pow(z1 - z2,2)), 1/2);
Console.WriteLine(distance);

// Выдает ответ 1 каждый раз, даже когда меняю цифры :(


////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

/* Задача 23: Напишите программу, которая принимает 
на вход число (N) и выдаёт таблицу 
кубов чисел от 1 до N. 
3 -> 1, 4, 9
5 -> 1, 8, 27, 64, 125 */

int N = 5;
int count = 1;

while(count <= 5)
{
    Console.Write(Math.Pow(count, 3) + " ");
    count++;
}
