/* Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N. */



int N = 7;
int A = 2;

while(A <= 7)
{
    if(A % 2 == 0)
    {
        Console.WriteLine(A);
    }
    A++;
}
