/* Задача 2: Напишите программу, которая на вход 
принимает два числа и выдаёт, 
какое число большее, а какое меньшее. */

Console.WriteLine("Введите первое число");
int n1 = int.Parse(Console.ReadLine());
Console.WriteLine("Введите второе число");
int n2 = int.Parse(Console.ReadLine());
int maxn = n1;

if(n1 > n2)
{
    maxn = n1;
} else if(n1 < n2)
{
    maxn = n2;
}

Console.WriteLine("Самое большое число: " + maxn);

// 2. Что нужно задать в коде, чтобы когда 
// пользователь введет строку, а не число, 
// программа не сломалась, а вышло сообщение об ошибке?




/////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////




/* Задача 4: Напишите программу, которая принимает на вход 
три числа и выдаёт максимальное из этих чисел. */

Console.WriteLine("Введние первое число");
int n1 = int.Parse(Console.ReadLine());
Console.WriteLine("Введние второе число");
int n2 = int.Parse(Console.ReadLine());
Console.WriteLine("Введние третье число");
int n3 = int.Parse(Console.ReadLine());

int maxn = n1;

if(n2 > n1 & n2 > n3)
{
    maxn = n2;
} else if(n3 > n1 & n3 > n2)
{
    maxn = n3;
}

Console.WriteLine("Самое больше число " + maxn);




/////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////




/* Задача 6 Напишите программу, которая на вход 
принимает число и выдаёт, является ли число чётным
 (делится ли оно на два без остатка). */

 Console.WriteLine("Введите число");
 int n = int.Parse(Console.ReadLine());

 if(n % 2 == 0)
 {
     Console.WriteLine("Поздравляю, Ваше число четное!");
 } 
 else
 {
     Console.WriteLine("Увы, Ваше число нечетное!");
 }




/////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////




/* Задача 8 Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N. */



int N = 7;
int A = 2;

while(A <= 7)
{
    if(A % 2 == 0)
    {
        Console.WriteLine(A);
    }
    A++;
}
