/* Задача 24: Напишите программу, которая принимает 
на вход число (А) и 
выдаёт сумму чисел от 1 до А. */

//Console.WriteLine() - функци
//int A = int.Parse(Console.ReadLine());

int func()
{
    Console.WriteLine("Запуск функции! n: " + n);
}
int num = 765543;
func(num);


/* Console.WriteLine("Введите число: ");
int A = int.Parse(Console.ReadLine());

int sum = 0;
for (int i = 0; i <= A; i++)
{
    sum += i;
}

Console.WriteLine(i);

Console.WriteLine(sum); */
